###
### Travail 2, ACT-7119
### Exemple
###
library(igraph)
d <- 32
A <- diag(32) # Matrice identité de d = 32

## Arètes
# (1, 2), (2, 3), (2, 4), (2, 5), (5, 6), (5, 7),
# (6, 8), (7, 9), (9, 11), (9, 14), (9, 13), (9, 12),
# (9, 11), (9, 10), (1, 16), (16, 18), (16, 17), (16, 19),
# (16, 20), (20, 22), (22, 21), (21, 23), (23, 24), (23, 25),
# (23, 26), (22, 28), (28, 27), (28, 29), (28, 30), (28, 31), (31, 32)

aretes <- matrix(c(1, 2, 2, 3, 2, 4, 2, 5, 5, 6, 5, 7,
                   6, 8, 7, 9, 9, 11, 9, 14, 9, 13, 9, 12,
                   9, 11, 9, 10, 1, 16, 16, 18, 16, 17, 16, 19,
                   16, 20, 20, 22, 22, 21, 21, 23, 23, 24, 23, 25,
                   23, 26, 22, 28, 28, 27, 28, 29, 28, 30, 28, 31, 31, 32),
                 byrow = TRUE, ncol = 2)

aretes_alpha <- cbind(aretes, c(0.2, 0.1, 0.1, 0.7, 0.3, 0.3, 0.4, 0.4, rep(0.6, 6),
                 0.7, 0.02, 0.03, 0.04, 0.5, 0.5, 0.4, 0.4, rep(0.1, 3),
                 0.9, rep(0.7, 4), 0.95))

for (i in 1:nrow(aretes))
{
    u <- aretes_alpha[i, 1]
    v <- aretes_alpha[i, 2]

    A[u, v] <- aretes_alpha[i, 3]
    A[v, u] <- aretes_alpha[i, 3]
}

A
g <- graph_from_adjacency_matrix(A, mode = "undirected",
                                 weighted = TRUE,
                                 diag = FALSE)
plot.igraph(g)
